{
  "title": "Chapter 2: Lost in the Shadows",
  "content": [
    "The morning came without mercy, sunlight streaming through the gaps in the curtains like an unwelcome visitor. Marcus woke on the couch, his neck stiff, the empty glass still clutched in his hand. The letter remained unopened, a silent accusation on the table.",
    "He stumbled to the kitchen, mechanically going through the motions of making coffee. The familiar ritual provided a small comfort, a pretense of normalcy in a world that had tilted off its axis. Steam rose from the mug, carrying with it memories of shared mornings, of two cups instead of one.",
    "The apartment felt larger now, spaces that once seemed cozy now yawning with emptiness. Her absence was everywhere—in the gap-toothed bookshelf where she had taken her favorites, in the bare spot on the wall where her painting had hung, in the silence where her music once played.",
    "Work called, but Marcus couldn't bring himself to answer. What did deadlines and meetings matter when his personal world had collapsed? He sent a terse email citing illness, not entirely a lie. The sickness he felt went deeper than any physical ailment.",
    "He found himself in her room—formerly their room—standing at the threshold like a trespasser. The bed was still unmade from the last night she had slept there, a month ago now. He hadn't been able to bring himself to change the sheets, clinging to the fading scent of her presence.",
    "On the dresser, a jewelry box sat open, revealing the necklace he had given her for their anniversary. She had left it behind, along with everything else that tied her to him. The message was clear: she wanted no reminders, no anchors to their shared past.",
    "Marcus picked up the necklace, letting the delicate chain run through his fingers. He remembered the joy in her eyes when she had opened the box, the way she had kissed him, the promises they had made. How quickly joy could turn to ash.",
    "The shadows in the room seemed to deepen as clouds passed over the sun. He sat on the edge of the bed, feeling the weight of all the words he should have said, all the moments he should have cherished more deeply. Regret was a prison of his own making.",
    "His phone buzzed with messages from concerned friends, but he couldn't face their pity or their well-meaning advice. They would tell him that time heals all wounds, that he would find someone else, that this too shall pass. But they didn't understand the depth of what he had lost.",
    "As afternoon faded into evening, Marcus remained in the gathering darkness, lost in the shadows of what had been and what might have been. The letter waited patiently, holding secrets he both yearned for and feared. Tomorrow, he promised himself again. Always tomorrow."
  ]
}
