{
  "title": "Chapter 3: The Weight of Memories",
  "content": [
    "Days blurred into weeks, each one a carbon copy of the last. Marcus had established a routine of sorts—wake, stare at the letter, drink, sleep, repeat. The unopened envelope had become both a shrine and a curse, dominating his thoughts even as he refused to confront its contents.",
    "He wandered through the apartment like a ghost haunting his own life. Every corner held a memory, every object a story. The coffee mug with the chip on the handle—she had dropped it during one of their silly kitchen dances. The throw pillow with the wine stain—from the night they had celebrated his promotion, laughing until their sides hurt.",
    "Work had stopped calling. His boss, initially sympathetic, had grown frustrated with the extended absence. Marcus knew he should care, should worry about his future, but the present was overwhelming enough. How could he think about tomorrow when today was an endless struggle?",
    "Friends attempted interventions. Jake showed up one evening with pizza and beer, determined to pull Marcus out of his spiral. They sat in awkward silence, the television providing white noise to fill the gaps in conversation. Jake meant well, but he couldn't understand. He had never loved someone so completely that their absence felt like a missing limb.",
    "\"You need to read it,\" Jake finally said, gesturing toward the letter. \"Whatever it says, it can't be worse than what you're imagining.\"",
    "But Marcus wasn't so sure. In his imagination, there was still hope—however slim—that she might return. The letter would end that hope, make the separation real and final. As long as it remained sealed, a part of him could pretend this was all temporary.",
    "That night, after Jake left, Marcus sat with the letter in his hands. He traced her handwriting with his finger, remembering how she used to leave him notes around the apartment. Little love letters hidden in his lunch bag, stuck to the bathroom mirror, tucked into his coat pocket. He had saved them all, though he couldn't bring himself to look at them now.",
    "The weight of memories was crushing. Each happy moment from their past now carried the bitter aftertaste of loss. Had she been unhappy even then? Had he missed the signs, too wrapped up in his own contentment to notice her pulling away?",
    "He thought about their last real conversation, before the silence had set in. She had tried to tell him something, her eyes pleading for understanding. But he had been distracted, stressed about a deadline, promising they would talk later. Later never came.",
    "As dawn broke through the windows, painting the room in shades of gray and gold, Marcus made a decision. Not today, but soon. Soon he would find the courage to face the truth. Soon he would read her words and accept whatever came next. But not today. Today, he would simply survive, and sometimes, that was enough."
  ]
}
